In [25]:
import pandas as pd
import numpy as np

In [10]:
df = pd.DataFrame(
    {
    'name':['mahdi','fatemeh','ali'],
    'sex':['male','female','male'],
    'age':[1100,18,68]
    }
)

In [11]:
df

      name     sex   age
0    mahdi    male  1100
1  fatemeh  female    18
2      ali    male    68

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   sex     3 non-null      object
 2   age     3 non-null      int64
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [14]:
print(df) #show the dataframe totally

      name     sex   age
0    mahdi    male  1100
1  fatemeh  female    18
2      ali    male    68

In [15]:
print(df['name'])  # show the series as 'name'

0      mahdi
1    fatemeh
2        ali
Name: name, dtype: object

In [17]:
age = pd.Series([22, 38, 15],name='age') #creation a series alone

In [18]:
age

0    22
1    38
2    15
Name: age, dtype: int64

In [20]:
df['age'].max()
age.max()

38

In [21]:
df.describe() #summary describtion

               age
count     3.000000
mean    395.333333
std     610.771097
min      18.000000
25%      43.000000
50%      68.000000
75%     584.000000
max    1100.000000

In [22]:
df['age'].sum()

1186

In [37]:
s = pd.DataFrame(np.random.randn(1000,4),columns = ['a','b','c','d'])
#s[::2]=np.nan
s.describe() #very important function

                a           b           c           d
count  500.000000  500.000000  500.000000  500.000000
mean     0.070132   -0.021262   -0.005613   -0.044431
std      1.009053    0.999586    0.942540    1.003106
min     -2.995019   -3.133002   -3.375100   -3.047997
25%     -0.602440   -0.672644   -0.624376   -0.700722
50%      0.090965    0.029683    0.009257   -0.033759
75%      0.757776    0.679917    0.600842    0.644952
max      2.931938    3.262264    2.891923    4.428658

In [43]:
h=pd.Series(['a','b','d',np.nan,'d'])
print(h)
h.describe()

0      a
1      b
2      d
3    NaN
4      d
dtype: object

count     4
unique    3
top       d
freq      2
dtype: object

In [49]:
frame = pd.DataFrame(
    {
        'a':['y','y','n','n'],
        'b':range(4)
}
)

In [51]:
frame.describe()

              b
count  4.000000
mean   1.500000
std    1.290994
min    0.000000
25%    0.750000
50%    1.500000
75%    2.250000
max    3.000000

In [52]:
frame.describe(include='all')

          a         b
count     4  4.000000
unique    2       NaN
top       y       NaN
freq      2       NaN
mean    NaN  1.500000
std     NaN  1.290994
min     NaN  0.000000
25%     NaN  0.750000
50%     NaN  1.500000
75%     NaN  2.250000
max     NaN  3.000000

In [53]:
frame.describe(include='object') # for textual data

        a
count   4
unique  2
top     y
freq    2

In [54]:
frame.describe(include='number') # for numbrical data

              b
count  4.000000
mean   1.500000
std    1.290994
min    0.000000
25%    0.750000
50%    1.500000
75%    2.250000
max    3.000000

In [58]:
#armin and argmax in numpy 
#idxmin and idxmax in pandas

s1 = pd.Series(np.random.randn(5))
print(s1)

print(s1.idxmin(), s1.idxmax())

0   -0.328441
1    0.869853
2   -0.065850
3    1.407621
4   -2.048073
dtype: float64
4 3

In [67]:
s2 = pd.DataFrame(np.random.randn(5,5),columns=['a','b','c','d','f'])
s2

          a         b         c         d         f
0 -0.033125  0.616913 -0.010110  0.701638  0.862681
1 -1.283484  0.061731  1.188897 -0.067774  0.590234
2  0.401067 -1.116194  0.917813 -0.077939 -0.635738
3 -1.143493 -1.112448 -0.364878  0.597703  0.545576
4 -1.601933  0.546975  1.454249  0.712408  0.569109

In [70]:
print(s2.idxmin(axis=0)) # idxmin in columns
print(s2.idxmax(axis=1)) #idxmax in rows

a    4
b    2
c    3
d    2
f    2
dtype: int64
0    f
1    c
2    c
3    d
4    c
dtype: object